EA/src/InformationRegisters/СоответствиеНоменклатурыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EA/src/Documents/ИмпортДанныхКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ИмпортДанныхКонтрагентов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗакупкиКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиКонтрагентов</xr:Item>
				<xr:Item>InformationRegister.ОстаткиНоменклатурыКонтрагентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПоОстаткам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПоЗакупкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПоПродажам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Закупки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоставщикКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоставщикиКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EA/src/Catalogs/НоменклатураКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>НоменклатураКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыПоставщиков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EA/src/CommonModules/ОбменДаннымиСКонтрагентами/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ЗагрузитьСправочникТоваров(Контрагент, ПараметрыЗагрузки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = ОбменДаннымиСКонтрагентамиКлиентСервер.РезультатЗагрузкиДанных();
	Результат.ВсегоСтрок = ПараметрыЗагрузки.ДанныеЗагрузки.Количество();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НоменклатураКонтрагентов.Код                      КАК Код,
	|	НоменклатураКонтрагентов.Ссылка                   КАК Ссылка,
	|	НоменклатураКонтрагентов.Наименование             КАК Наименование,
	|	НоменклатураКонтрагентов.Производитель            КАК Производитель,
	|	НоменклатураКонтрагентов.Штрихкод                 КАК Штрихкод,
	|	СоответствиеНоменклатурыКонтрагентов.Номенклатура КАК Номенклатура
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыКонтрагентов КАК СоответствиеНоменклатурыКонтрагентов
	|		ПО НоменклатураКонтрагентов.Ссылка = СоответствиеНоменклатурыКонтрагентов.НоменклатураКонтрагента
	|ГДЕ
	|	НоменклатураКонтрагентов.Владелец = &Владелец";
	
	ТаблицаСправочника = Запрос.Выполнить().Выгрузить();
	ТаблицаСправочника.Индексы.Добавить("Код");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НоменклатураКонтрагентовКодыПоставщиков.Ссылка    КАК Ссылка,
	|	НоменклатураКонтрагентовКодыПоставщиков.Код       КАК Код,
	|	НоменклатураКонтрагентовКодыПоставщиков.Поставщик КАК Поставщик
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов.КодыПоставщиков КАК НоменклатураКонтрагентовКодыПоставщиков
	|ГДЕ
	|	НоменклатураКонтрагентовКодыПоставщиков.Ссылка.Владелец = &Владелец";
	
	ТаблицаКодовПоставщиков = Запрос.Выполнить().Выгрузить();
	ТаблицаКодовПоставщиков.Индексы.Добавить("Ссылка");
	
	ДанныеЗагрузки = ПараметрыЗагрузки.ДанныеЗагрузки;
	ИдентификаторыПоставщиков = ПараметрыЗагрузки.ИдентификаторыПоставщиков;
	
	//НачатьТранзакцию();
	
	НомерСтроки = 0;
	Для Каждого СтруктураДанных Из ДанныеЗагрузки Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		Если Не СтруктураДанных.Свойство("КодТовара") Или Не СтруктураДанных.Свойство("НаименованиеТовара") Тогда
			ТекстОшибки = НСтр("ru='Для загрузки справочника товаров должны быть обязательно указаны ""Код"" и ""Наименование""'");
			ДобавитьСтрокуСОшибкой(Результат, НомерСтроки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(СтруктураДанных.КодТовара) = Тип("Число") Тогда
			КодТовара = Формат(СтруктураДанных.КодТовара, "ЧГ=0");
		Иначе
			КодТовара = СокрЛП(СтруктураДанных.КодТовара);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КодТовара) Тогда
			ТекстОшибки = НСтр("ru='Не заполнен код товара'");
			ДобавитьСтрокуСОшибкой(Результат, НомерСтроки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы = ТаблицаСправочника.Найти(КодТовара, "Код");
		Если СтрокаТаблицы = Неопределено Тогда
			Объект = Справочники.НоменклатураКонтрагентов.СоздатьЭлемент();
			Объект.Владелец = Контрагент;
			Объект.Код = КодТовара;
		Иначе
			Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура)
				И Не ДанныеНоменклатурыИзменены(СтрокаТаблицы, СтруктураДанных, ТаблицаКодовПоставщиков, ИдентификаторыПоставщиков) Тогда
				Результат.ЗагруженоСтрок = Результат.ЗагруженоСтрок + 1;
				Продолжить;
			КонецЕсли;
			
			Объект = СтрокаТаблицы.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		ЭтоНовый = Не ЗначениеЗаполнено(Объект.Ссылка);
		
		Объект.Наименование = СокрЛП(СтруктураДанных.НаименованиеТовара);
		
		Если СтруктураДанных.Свойство("НаименованиеПроизводителя") И ЗначениеЗаполнено(СтруктураДанных.НаименованиеПроизводителя) Тогда
			Объект.Производитель = СокрЛП(СтруктураДанных.НаименованиеПроизводителя);
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("Штрихкод") И ЗначениеЗаполнено(СтруктураДанных.Штрихкод) Тогда
			Объект.Штрихкод = СокрЛП(СтруктураДанных.Штрихкод);
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СтруктураДанных Цикл
			Если СтрНачинаетсяС(КлючЗначение.Ключ, "Поставщик") Тогда
				Если ЗначениеЗаполнено(КлючЗначение.Значение)
					И (ЭтоНовый Или Не ЕстьДанныеПоставщика(ИдентификаторыПоставщиков[КлючЗначение.Ключ], КлючЗначение.Значение, ТаблицаКодовПоставщиков, Объект.Ссылка)) Тогда
					
					Если ТипЗнч(КлючЗначение.Значение) = Тип("Число") Тогда
						КодПоставщика = Формат(КлючЗначение.Значение, "ЧГ=0");
					Иначе
						КодПоставщика = СокрЛП(КлючЗначение.Значение);
					КонецЕсли;
					
					СтрокаТЧ = Объект.КодыПоставщиков.Добавить();
					СтрокаТЧ.Код = КодПоставщика;
					СтрокаТЧ.Поставщик = ИдентификаторыПоставщиков[КлючЗначение.Ключ];
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			Объект.Записать();
		Исключение
			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ДобавитьСтрокуСОшибкой(Результат, НомерСтроки, ТекстОшибки);
			Продолжить;
		КонецПопытки;
		
		Номенклатура = Неопределено;
		Если ЭтоНовый Или Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			Номенклатура = СопоставитьНоменклатуруКонтрагента(Объект);
		КонецЕсли;
		
		Если ЭтоНовый Тогда
			Результат.СозданныеЭлементы.Вставить(СтруктураДанных.КодТовара, Объект.Ссылка);
			
			СтрокаТаблицы = ТаблицаСправочника.Добавить();
			СтрокаТаблицы.Код           = КодТовара;
			СтрокаТаблицы.Ссылка        = Объект.Ссылка;
			СтрокаТаблицы.Наименование  = Объект.Наименование;
			СтрокаТаблицы.Производитель = Объект.Производитель;
			СтрокаТаблицы.Штрихкод      = Объект.Штрихкод;
			СтрокаТаблицы.Номенклатура  = Номенклатура;
		КонецЕсли;
		
		Результат.ЗагруженоСтрок = Результат.ЗагруженоСтрок + 1;
		
	КонецЦикла;
	
	//ЗафиксироватьТранзакцию();
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьОстатки(Контрагент, ДанныеЗагрузки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = ОбменДаннымиСКонтрагентамиКлиентСервер.РезультатЗагрузкиДанных();
	Результат.ВсегоСтрок = ДанныеЗагрузки.Количество();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НоменклатураКонтрагентов.Код КАК Код,
	|	НоменклатураКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|ГДЕ
	|	НоменклатураКонтрагентов.Владелец = &Владелец";
	
	ТаблицаСправочника = Запрос.Выполнить().Выгрузить();
	ТаблицаСправочника.Индексы.Добавить("Код");
	
	ДокументОбъект = Документы.ИмпортДанныхКонтрагентов.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Контрагент = Контрагент;
	
	НомерСтроки = 0;
	Для Каждого СтруктураДанных Из ДанныеЗагрузки Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		Если Не СтруктураДанных.Свойство("КодТовара") Или (Не СтруктураДанных.Свойство("НачальныйОстаток") И Не СтруктураДанных.Свойство("КонечныйОстаток")) Тогда
			ТекстОшибки = НСтр("ru='Для загрузки остатков должно быть обязательно заполнено поле ""Код"" и начальный или конечный остаток'");
			ДобавитьСтрокуСОшибкой(Результат, НомерСтроки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(СтруктураДанных.КодТовара) = Тип("Число") Тогда
			КодТовара = Формат(СтруктураДанных.КодТовара, "ЧГ=0");
		Иначе
			КодТовара = СокрЛП(СтруктураДанных.КодТовара);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КодТовара) Тогда
			ТекстОшибки = НСтр("ru='Не заполнен код товара'");
			ДобавитьСтрокуСОшибкой(Результат, НомерСтроки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы = ТаблицаСправочника.Найти(КодТовара, "Код");
		Если СтрокаТаблицы = Неопределено Тогда
			ТекстОшибки = НСтр("ru='Не найдена номенклатура контрагента с кодом %1'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, СтруктураДанных.КодТовара);
			ДобавитьСтрокуСОшибкой(Результат, НомерСтроки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧ = ДокументОбъект.Остатки.Добавить();
		СтрокаТЧ.НоменклатураКонтрагента = СтрокаТаблицы.Ссылка;
		
		Если СтруктураДанных.Свойство("НачальныйОстаток") Тогда
			СтрокаТЧ.НачальныйОстаток = СтруктураДанных.НачальныйОстаток;
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("КонечныйОстаток") Тогда
			СтрокаТЧ.КонечныйОстаток = СтруктураДанных.КонечныйОстаток;
		КонецЕсли;
		
		Результат.ЗагруженоСтрок = Результат.ЗагруженоСтрок + 1;
		
	КонецЦикла;
	
	Если ДокументОбъект.Остатки.Количество() > 0 Тогда
		ДокументОбъект.Записать();
		
		Если ДокументОбъект.ПроверитьЗаполнение() Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		Результат.ДокументСсылка = ДокументОбъект.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьЗакупки(Контрагент, ДанныеЗагрузки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = ОбменДаннымиСКонтрагентамиКлиентСервер.РезультатЗагрузкиДанных();
	Результат.ВсегоСтрок = ДанныеЗагрузки.Количество();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НоменклатураКонтрагентов.Код КАК Код,
	|	НоменклатураКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|ГДЕ
	|	НоменклатураКонтрагентов.Владелец = &Владелец";
	
	ТаблицаСправочника = Запрос.Выполнить().Выгрузить();
	ТаблицаСправочника.Индексы.Добавить("Код");
	
	ТаблицаПоставщиков = ТаблицаПоставщиковДляПоиска();
	
	ДокументОбъект = Документы.ИмпортДанныхКонтрагентов.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Контрагент = Контрагент;
	
	НомерСтроки = 0;
	Для Каждого СтруктураДанных Из ДанныеЗагрузки Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		Если Не СтруктураДанных.Свойство("КодТовара") Или Не СтруктураДанных.Свойство("Количество")
			Или (Не СтруктураДанных.Свойство("ИНН") И Не СтруктураДанных.Свойство("НаименованиеПоставщика"))Тогда
			ТекстОшибки = НСтр("ru='Для загрузки закупок должны быть обязательно указаны ""Код"", ""Количество"" и ИНН или наименование поставщика'");
			ДобавитьСтрокуСОшибкой(Результат, НомерСтроки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(СтруктураДанных.КодТовара) = Тип("Число") Тогда
			КодТовара = Формат(СтруктураДанных.КодТовара, "ЧГ=0");
		Иначе
			КодТовара = СокрЛП(СтруктураДанных.КодТовара);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КодТовара) Тогда
			ТекстОшибки = НСтр("ru='Не заполнен код товара'");
			ДобавитьСтрокуСОшибкой(Результат, НомерСтроки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтруктураДанных.Количество) Тогда
			ТекстОшибки = НСтр("ru='Не заполнено количество'");
			ДобавитьСтрокуСОшибкой(Результат, НомерСтроки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы = ТаблицаСправочника.Найти(КодТовара, "Код");
		Если СтрокаТаблицы = Неопределено Тогда
			ТекстОшибки = НСтр("ru='Не найдена номенклатура контрагента с кодом %1'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, СтруктураДанных.КодТовара);
			ДобавитьСтрокуСОшибкой(Результат, НомерСтроки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицыПоставщиков = Неопределено;
		
		Если СтруктураДанных.Свойство("ИНН") И ЗначениеЗаполнено(СтруктураДанных.ИНН) Тогда
			СтрокаТаблицыПоставщиков = ТаблицаПоставщиков.Найти(СокрЛП(СтруктураДанных.ИНН), "ИНН");
		КонецЕсли;
		
		Если СтрокаТаблицыПоставщиков = Неопределено
			И СтруктураДанных.Свойство("НаименованиеПоставщика") И ЗначениеЗаполнено(СтруктураДанных.НаименованиеПоставщика) Тогда
			СтрокаТаблицыПоставщиков = ТаблицаПоставщиков.Найти(ВРег(СтрЗаменить(СтруктураДанных.НаименованиеПоставщика, " ", "")), "НаименованиеПоиск");
		КонецЕсли;
		
		Если СтрокаТаблицыПоставщиков = Неопределено Тогда
			Объект = Справочники.ПоставщикиКонтрагентов.СоздатьЭлемент();
			Объект.Владелец = Контрагент;
			Если СтруктураДанных.Свойство("ИНН") И ЗначениеЗаполнено(СтруктураДанных.ИНН) Тогда
				Объект.ИНН = СтруктураДанных.ИНН;
			КонецЕсли;
			Если СтруктураДанных.Свойство("НаименованиеПоставщика") И ЗначениеЗаполнено(СтруктураДанных.НаименованиеПоставщика) Тогда
				Объект.Наименование = СтруктураДанных.НаименованиеПоставщика;
			Иначе
				Объект.Наименование = НСтр("ru='Неизвестный поставщик (%1)'");
				Объект.Наименование = СтрШаблон(Объект.Наименование, Объект.ИНН);
			КонецЕсли;
			Объект.Записать();
			
			СтрокаТаблицыПоставщиков = ТаблицаПоставщиков.Добавить();
			СтрокаТаблицыПоставщиков.ИНН = Объект.ИНН;
			СтрокаТаблицыПоставщиков.Наименование = Объект.Наименование;
			СтрокаТаблицыПоставщиков.НаименованиеПоиск = ВРег(СтрЗаменить(СтрокаТаблицыПоставщиков.Наименование, " ", ""));
			СтрокаТаблицыПоставщиков.Ссылка = Объект.Ссылка;
		КонецЕсли;
		
		СтрокаТЧ = ДокументОбъект.Закупки.Добавить();
		СтрокаТЧ.НоменклатураКонтрагента = СтрокаТаблицы.Ссылка;
		СтрокаТЧ.ПоставщикКонтрагента = СтрокаТаблицыПоставщиков.Ссылка;
		СтрокаТЧ.Количество = СтруктураДанных.Количество;
		
		Если СтруктураДанных.Свойство("Дата") Тогда
			СтрокаТЧ.Дата = СтруктураДанных.Дата;
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("ЦенаЗакупки") Тогда
			СтрокаТЧ.Цена = СтруктураДанных.ЦенаЗакупки;
		КонецЕсли;
		
		СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		
		Результат.ЗагруженоСтрок = Результат.ЗагруженоСтрок + 1;
		
	КонецЦикла;
	
	Если ДокументОбъект.Закупки.Количество() > 0 Тогда
		ДокументОбъект.Записать();
		
		Если ДокументОбъект.ПроверитьЗаполнение() Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		Результат.ДокументСсылка = ДокументОбъект.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьПродажи(Контрагент, ДанныеЗагрузки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = ОбменДаннымиСКонтрагентамиКлиентСервер.РезультатЗагрузкиДанных();
	Результат.ВсегоСтрок = ДанныеЗагрузки.Количество();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НоменклатураКонтрагентов.Код КАК Код,
	|	НоменклатураКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|ГДЕ
	|	НоменклатураКонтрагентов.Владелец = &Владелец";
	
	ТаблицаСправочника = Запрос.Выполнить().Выгрузить();
	ТаблицаСправочника.Индексы.Добавить("Код");
	
	ДокументОбъект = Документы.ИмпортДанныхКонтрагентов.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Контрагент = Контрагент;
	
	НомерСтроки = 0;
	Для Каждого СтруктураДанных Из ДанныеЗагрузки Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		Если Не СтруктураДанных.Свойство("КодТовара") Или Не СтруктураДанных.Свойство("Количество") Тогда
			ТекстОшибки = НСтр("ru='Для загрузки продаж должны быть обязательно указаны ""Код"" и ""Количество""'");
			ДобавитьСтрокуСОшибкой(Результат, НомерСтроки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(СтруктураДанных.КодТовара) = Тип("Число") Тогда
			КодТовара = Формат(СтруктураДанных.КодТовара, "ЧГ=0");
		Иначе
			КодТовара = СокрЛП(СтруктураДанных.КодТовара);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КодТовара) Тогда
			ТекстОшибки = НСтр("ru='Не заполнен код товара'");
			ДобавитьСтрокуСОшибкой(Результат, НомерСтроки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		НачальныйОстаток = 0;
		КонечныйОстаток = 0;
		
		Если СтруктураДанных.Свойство("НачальныйОстаток") И ЗначениеЗаполнено(СтруктураДанных.НачальныйОстаток) Тогда
			НачальныйОстаток = СтруктураДанных.НачальныйОстаток;
		КонецЕсли;
		Если СтруктураДанных.Свойство("КонечныйОстаток") И ЗначениеЗаполнено(СтруктураДанных.КонечныйОстаток) Тогда
			КонечныйОстаток = СтруктураДанных.КонечныйОстаток;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтруктураДанных.Количество) И (НачальныйОстаток <> 0 Или КонечныйОстаток <> 0) Тогда
			ТекстОшибки = НСтр("ru='Не заполнено количество'");
			ДобавитьСтрокуСОшибкой(Результат, НомерСтроки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы = ТаблицаСправочника.Найти(КодТовара, "Код");
		Если СтрокаТаблицы = Неопределено Тогда
			ТекстОшибки = НСтр("ru='Не найдена номенклатура контрагента с кодом %1'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, СтруктураДанных.КодТовара);
			ДобавитьСтрокуСОшибкой(Результат, НомерСтроки, ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанных.Количество) Тогда
			СтрокаТЧ = ДокументОбъект.Продажи.Добавить();
			СтрокаТЧ.НоменклатураКонтрагента = СтрокаТаблицы.Ссылка;
			СтрокаТЧ.Количество = СтруктураДанных.Количество;
			
			Если СтруктураДанных.Свойство("Дата") Тогда
				СтрокаТЧ.Дата = СтруктураДанных.Дата;
			КонецЕсли;
			
			Если СтруктураДанных.Свойство("ЦенаЗакупки") Тогда
				СтрокаТЧ.ЦенаЗакупки = СтруктураДанных.ЦенаЗакупки;
			КонецЕсли;
			
			Если СтруктураДанных.Свойство("ЦенаПродажи") Тогда
				СтрокаТЧ.ЦенаПродажи = СтруктураДанных.ЦенаПродажи;
			КонецЕсли;
			
			СтрокаТЧ.СуммаЗакупки = СтрокаТЧ.Количество * СтрокаТЧ.ЦенаЗакупки;
			СтрокаТЧ.СуммаПродажи = СтрокаТЧ.Количество * СтрокаТЧ.ЦенаПродажи;
		КонецЕсли;
		
		Если НачальныйОстаток <> 0 Или КонечныйОстаток <> 0 Тогда
			СтрокаТЧ = ДокументОбъект.Остатки.Добавить();
			СтрокаТЧ.НоменклатураКонтрагента = СтрокаТаблицы.Ссылка;
			
			Если НачальныйОстаток <> 0 Тогда
				СтрокаТЧ.НачальныйОстаток = СтруктураДанных.НачальныйОстаток;
			КонецЕсли;
			
			Если КонечныйОстаток <> 0 Тогда
				СтрокаТЧ.КонечныйОстаток = СтруктураДанных.КонечныйОстаток;
			КонецЕсли;
		КонецЕсли;
		
		Результат.ЗагруженоСтрок = Результат.ЗагруженоСтрок + 1;
		
	КонецЦикла;
	
	Если ДокументОбъект.Продажи.Количество() > 0 Тогда
		ДокументОбъект.Записать();
		
		Если ДокументОбъект.ПроверитьЗаполнение() Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		Результат.ДокументСсылка = ДокументОбъект.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаПоставщиковДляПоиска() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоставщикиКонтрагентов.Ссылка       КАК Ссылка,
	|	ПоставщикиКонтрагентов.ИНН          КАК ИНН,
	|	ПоставщикиКонтрагентов.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ПоставщикиКонтрагентов КАК ПоставщикиКонтрагентов
	|ГДЕ
	|	НЕ ПоставщикиКонтрагентов.ПометкаУдаления
	|	И (ПоставщикиКонтрагентов.ИНН <> """"
	|			ИЛИ ПоставщикиКонтрагентов.Наименование <> """")";
	
	ТаблицаПоставщиков = Запрос.Выполнить().Выгрузить();
	ТаблицаПоставщиков.Колонки.Добавить("ИННПоиск");
	ТаблицаПоставщиков.Колонки.Добавить("НаименованиеПоиск");
	
	Для Каждого СтрокаТаблицы Из ТаблицаПоставщиков Цикл
		СтрокаТаблицы.ИННПоиск = СокрЛП(СтрокаТаблицы.ИНН);
		СтрокаТаблицы.НаименованиеПоиск = ВРег(СтрЗаменить(СтрокаТаблицы.Наименование, " ", ""));
	КонецЦикла;
	
	Возврат ТаблицаПоставщиков;
	
КонецФункции

Функция ДанныеНоменклатурыИзменены(ДанныеСправочника, ЗагружаемыеДанные, ТаблицаКодовПоставщиков, ИдентификаторыПоставщиков)
	
	Если СокрЛП(ДанныеСправочника.Наименование) <> СокрЛП(ЗагружаемыеДанные.НаименованиеТовара) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗагружаемыеДанные.Свойство("НаименованиеПроизводителя")
		И ЗначениеЗаполнено(ЗагружаемыеДанные.НаименованиеПроизводителя)
		И СокрЛП(ДанныеСправочника.Производитель) <> СокрЛП(ЗагружаемыеДанные.НаименованиеПроизводителя) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗагружаемыеДанные.Свойство("Штрихкод")
		И ЗначениеЗаполнено(ЗагружаемыеДанные.Штрихкод)
		И СокрЛП(ДанныеСправочника.Штрихкод) <> СокрЛП(ЗагружаемыеДанные.Штрихкод) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из ЗагружаемыеДанные Цикл
		Если СтрНачинаетсяС(КлючЗначение.Ключ, "Поставщик") Тогда
			Если Не ЕстьДанныеПоставщика(ИдентификаторыПоставщиков[КлючЗначение.Ключ], КлючЗначение.Значение, ТаблицаКодовПоставщиков, ДанныеСправочника.Ссылка) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЕстьДанныеПоставщика(Поставщик, КодПоставщика, ТаблицаКодовПоставщиков, НоменклатураКонтрагента)
	
	Если ТипЗнч(КодПоставщика) = Тип("Число") Тогда
		КодПоставщикаСтрока = Формат(КодПоставщика, "ЧГ=0");
	Иначе
		КодПоставщикаСтрока = СокрЛП(КодПоставщика);
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка",    НоменклатураКонтрагента);
	ПараметрыОтбора.Вставить("Код",       КодПоставщикаСтрока);
	ПараметрыОтбора.Вставить("Поставщик", Поставщик);
	
	Возврат ТаблицаКодовПоставщиков.НайтиСтроки(ПараметрыОтбора).Количество() <> 0;
	
КонецФункции

Функция СопоставитьНоменклатуруКонтрагента(НоменклатураКонтрагентаОбъект)
	
	Номенклатура = Неопределено;
	
	Если ЗначениеЗаполнено(НоменклатураКонтрагентаОбъект.Штрихкод) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Штрихкод", НоменклатураКонтрагентаОбъект.Штрихкод);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаводскиеШК.Владелец КАК Номенклатура
		|ИЗ
		|	Справочник.ЗаводскиеШК КАК ЗаводскиеШК
		|ГДЕ
		|	НЕ ЗаводскиеШК.ПометкаУдаления
		|	И ЗаводскиеШК.Наименование = &Штрихкод
		|	И НЕ ЗаводскиеШК.Владелец.ПометкаУдаления";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			Номенклатура = Выборка.Номенклатура;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		КодыПоставщиков = НоменклатураКонтрагентаОбъект.КодыПоставщиков.Выгрузить();
		Если КодыПоставщиков.Количество() > 0 Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("КодыПоставщиков", КодыПоставщиков);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	КодыПоставщиков.Код КАК Код,
			|	КодыПоставщиков.Поставщик КАК Поставщик
			|ПОМЕСТИТЬ КодыПоставщиков
			|ИЗ
			|	&КодыПоставщиков КАК КодыПоставщиков
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СоответствиеНоменклатурыКонтрагентов.Номенклатура КАК Номенклатура
			|ИЗ
			|	КодыПоставщиков КАК КодыНоменклатурыПоставщиков
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыКонтрагентов КАК СоответствиеНоменклатурыКонтрагентов
			|			ПО НоменклатураКонтрагентов.Ссылка = СоответствиеНоменклатурыКонтрагентов.НоменклатураКонтрагента
			|		ПО КодыНоменклатурыПоставщиков.Код = НоменклатураКонтрагентов.Код
			|			И КодыНоменклатурыПоставщиков.Поставщик = НоменклатураКонтрагентов.Владелец
			|ГДЕ
			|	НЕ НоменклатураКонтрагентов.ПометкаУдаления";
			
			РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				
				Номенклатура = Выборка.Номенклатура;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Наименование", НоменклатураКонтрагентаОбъект.Наименование);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И (Номенклатура.Наименование = &Наименование
		|			ИЛИ Номенклатура.ПолноеНаименование = &Наименование
		|			ИЛИ Номенклатура.КраткоеНаименование = &Наименование)";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			Номенклатура = Выборка.Номенклатура;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Наименование", НоменклатураКонтрагентаОбъект.Наименование);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СоответствиеНоменклатурыКонтрагентов.Номенклатура КАК Номенклатура
		|ИЗ
		|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыКонтрагентов КАК СоответствиеНоменклатурыКонтрагентов
		|		ПО НоменклатураКонтрагентов.Ссылка = СоответствиеНоменклатурыКонтрагентов.НоменклатураКонтрагента
		|ГДЕ
		|	НоменклатураКонтрагентов.Наименование = &Наименование
		|	И НЕ НоменклатураКонтрагентов.ПометкаУдаления
		|	И НЕ СоответствиеНоменклатурыКонтрагентов.Номенклатура.ПометкаУдаления";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			Номенклатура = Выборка.Номенклатура;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Запись = РегистрыСведений.СоответствиеНоменклатурыКонтрагентов.СоздатьМенеджерЗаписи();
		Запись.НоменклатураКонтрагента = НоменклатураКонтрагентаОбъект.Ссылка;
		Запись.Номенклатура = Номенклатура;
		Запись.Записать();
	КонецЕсли;
	
	Возврат Номенклатура;
	
КонецФункции

Процедура ДобавитьСтрокуСОшибкой(Результат, НомерСтроки, ТекстОшибки)
	
	СтрокаСОшибкой = Новый Структура;
	СтрокаСОшибкой.Вставить("НомерСтроки", НомерСтроки);
	СтрокаСОшибкой.Вставить("ТекстОшибки", ТекстОшибки);
	
	Результат.СтрокиСОшибками.Добавить(СтрокаСОшибкой);
	
КонецПроцедуры

#КонецОбласти
